7767517
111 125
Input                    input                    0 1 input
Convolution              241                      1 1 input 242 0=16 1=3 3=2 4=1 5=1 6=432
HardSwish                248                      1 1 242 248 0=1.666667e-01
Split                    splitncnn_0              1 2 248 248_splitncnn_0 248_splitncnn_1
Convolution              249                      1 1 248_splitncnn_1 251 0=16 1=1 5=1 6=256 9=1
ConvolutionDepthWise     252                      1 1 251 254 0=16 1=3 4=1 5=1 6=144 7=16 9=1
Convolution              255                      1 1 254 256 0=16 1=1 5=1 6=256
BinaryOp                 257                      2 1 248_splitncnn_0 256 257
Convolution              258                      1 1 257 260 0=64 1=1 5=1 6=1024 9=1
ConvolutionDepthWise     261                      1 1 260 263 0=64 1=3 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              264                      1 1 263 265 0=24 1=1 5=1 6=1536
Split                    splitncnn_1              1 2 265 265_splitncnn_0 265_splitncnn_1
Convolution              266                      1 1 265_splitncnn_1 268 0=72 1=1 5=1 6=1728 9=1
ConvolutionDepthWise     269                      1 1 268 271 0=72 1=3 4=1 5=1 6=648 7=72 9=1
Convolution              272                      1 1 271 273 0=24 1=1 5=1 6=1728
BinaryOp                 274                      2 1 265_splitncnn_0 273 274
Convolution              275                      1 1 274 277 0=72 1=1 5=1 6=1728 9=1
ConvolutionDepthWise     278                      1 1 277 279 0=72 1=5 3=2 4=2 5=1 6=1800 7=72
Split                    splitncnn_2              1 2 279 279_splitncnn_0 279_splitncnn_1
Pooling                  286                      1 1 279_splitncnn_1 290 0=1 4=1
InnerProduct             292                      1 1 290 293 0=18 2=1296 9=1
InnerProduct             295                      1 1 293 295 0=72 2=1296
HardSigmoid              300                      1 1 295 300 0=1.666667e-01
BinaryOp                 309                      2 1 279_splitncnn_0 300 309 0=2
ReLU                     310                      1 1 309 310
Convolution              311                      1 1 310 312 0=40 1=1 5=1 6=2880
Split                    splitncnn_3              1 2 312 312_splitncnn_0 312_splitncnn_1
Convolution              313                      1 1 312_splitncnn_1 315 0=120 1=1 5=1 6=4800 9=1
ConvolutionDepthWise     316                      1 1 315 317 0=120 1=5 4=2 5=1 6=3000 7=120
Split                    splitncnn_4              1 2 317 317_splitncnn_0 317_splitncnn_1
Pooling                  324                      1 1 317_splitncnn_1 328 0=1 4=1
InnerProduct             330                      1 1 328 331 0=30 2=3600 9=1
InnerProduct             333                      1 1 331 333 0=120 2=3600
HardSigmoid              338                      1 1 333 338 0=1.666667e-01
BinaryOp                 347                      2 1 317_splitncnn_0 338 347 0=2
ReLU                     348                      1 1 347 348
Convolution              349                      1 1 348 350 0=40 1=1 5=1 6=4800
BinaryOp                 351                      2 1 312_splitncnn_0 350 351
Split                    splitncnn_5              1 2 351 351_splitncnn_0 351_splitncnn_1
Convolution              352                      1 1 351_splitncnn_1 354 0=120 1=1 5=1 6=4800 9=1
ConvolutionDepthWise     355                      1 1 354 356 0=120 1=5 4=2 5=1 6=3000 7=120
Split                    splitncnn_6              1 2 356 356_splitncnn_0 356_splitncnn_1
Pooling                  363                      1 1 356_splitncnn_1 367 0=1 4=1
InnerProduct             369                      1 1 367 370 0=30 2=3600 9=1
InnerProduct             372                      1 1 370 372 0=120 2=3600
HardSigmoid              377                      1 1 372 377 0=1.666667e-01
BinaryOp                 386                      2 1 356_splitncnn_0 377 386 0=2
ReLU                     387                      1 1 386 387
Convolution              388                      1 1 387 389 0=40 1=1 5=1 6=4800
BinaryOp                 390                      2 1 351_splitncnn_0 389 390
Convolution              391                      1 1 390 393 0=240 1=1 5=1 6=9600 9=1
ConvolutionDepthWise     394                      1 1 393 396 0=240 1=3 3=2 4=1 5=1 6=2160 7=240 9=1
Convolution              397                      1 1 396 398 0=80 1=1 5=1 6=19200
Split                    splitncnn_7              1 2 398 398_splitncnn_0 398_splitncnn_1
Convolution              399                      1 1 398_splitncnn_1 400 0=200 1=1 5=1 6=16000
HardSwish                406                      1 1 400 406 0=1.666667e-01
ConvolutionDepthWise     407                      1 1 406 408 0=200 1=3 4=1 5=1 6=1800 7=200
HardSwish                414                      1 1 408 414 0=1.666667e-01
Convolution              415                      1 1 414 416 0=80 1=1 5=1 6=16000
BinaryOp                 417                      2 1 398_splitncnn_0 416 417
Convolution              418                      1 1 417 419 0=480 1=1 5=1 6=38400
HardSwish                425                      1 1 419 425 0=1.666667e-01
ConvolutionDepthWise     426                      1 1 425 427 0=480 1=3 4=1 5=1 6=4320 7=480
Split                    splitncnn_8              1 2 427 427_splitncnn_0 427_splitncnn_1
Pooling                  434                      1 1 427_splitncnn_1 438 0=1 4=1
InnerProduct             440                      1 1 438 441 0=120 2=57600 9=1
InnerProduct             443                      1 1 441 443 0=480 2=57600
HardSigmoid              448                      1 1 443 448 0=1.666667e-01
BinaryOp                 457                      2 1 427_splitncnn_0 448 457 0=2
HardSwish                463                      1 1 457 463 0=1.666667e-01
Convolution              464                      1 1 463 465 0=112 1=1 5=1 6=53760
Split                    splitncnn_9              1 2 465 465_splitncnn_0 465_splitncnn_1
Convolution              466                      1 1 465_splitncnn_1 467 0=672 1=1 5=1 6=75264
HardSwish                473                      1 1 467 473 0=1.666667e-01
ConvolutionDepthWise     474                      1 1 473 475 0=672 1=3 4=1 5=1 6=6048 7=672
Split                    splitncnn_10             1 2 475 475_splitncnn_0 475_splitncnn_1
Pooling                  482                      1 1 475_splitncnn_1 486 0=1 4=1
InnerProduct             488                      1 1 486 489 0=168 2=112896 9=1
InnerProduct             491                      1 1 489 491 0=672 2=112896
HardSigmoid              496                      1 1 491 496 0=1.666667e-01
BinaryOp                 505                      2 1 475_splitncnn_0 496 505 0=2
HardSwish                511                      1 1 505 511 0=1.666667e-01
Convolution              512                      1 1 511 513 0=112 1=1 5=1 6=75264
BinaryOp                 514                      2 1 465_splitncnn_0 513 514
Convolution              515                      1 1 514 516 0=672 1=1 5=1 6=75264
HardSwish                522                      1 1 516 522 0=1.666667e-01
ConvolutionDepthWise     523                      1 1 522 524 0=672 1=3 4=1 5=1 6=6048 7=672
Split                    splitncnn_11             1 2 524 524_splitncnn_0 524_splitncnn_1
Pooling                  531                      1 1 524_splitncnn_1 535 0=1 4=1
InnerProduct             537                      1 1 535 538 0=168 2=112896 9=1
InnerProduct             540                      1 1 538 540 0=672 2=112896
HardSigmoid              545                      1 1 540 545 0=1.666667e-01
BinaryOp                 554                      2 1 524_splitncnn_0 545 554 0=2
HardSwish                560                      1 1 554 560 0=1.666667e-01
Convolution              561                      1 1 560 562 0=160 1=1 5=1 6=107520
Convolution              563                      1 1 562 564 0=320 1=1 5=1 6=51200
HardSwish                570                      1 1 564 570 0=1.666667e-01
ConvolutionDepthWise     571                      1 1 570 572 0=320 1=3 4=1 5=1 6=2880 7=320
HardSwish                578                      1 1 572 578 0=1.666667e-01
Convolution              579                      1 1 578 580 0=16 1=1 5=1 6=5120
Split                    splitncnn_12             1 2 580 580_splitncnn_0 580_splitncnn_1
Pooling                  582                      1 1 580_splitncnn_1 582 0=1 1=14 2=14 5=1
Reshape                  590                      1 1 582 590 0=-1
Convolution              591                      1 1 580_splitncnn_0 591 0=32 1=3 3=2 4=1 5=1 6=4608
Split                    splitncnn_13             1 2 591 591_splitncnn_0 591_splitncnn_1
Pooling                  593                      1 1 591_splitncnn_1 593 0=1 1=7 2=7 5=1
Reshape                  601                      1 1 593 601 0=-1
Convolution              602                      1 1 591_splitncnn_0 602 0=128 1=7 5=1 6=200704
Reshape                  610                      1 1 602 610 0=-1
Concat                   611                      3 1 590 601 610 611
InnerProduct             output                   1 1 611 output 0=42 1=1 2=7392
